# Opacity

## Description
Sets the active opacity.

```pascal
PROCEDURE Opacity(opacity : INTEGER);
```

```python
def vs.Opacity(opacity):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|opacity|INTEGER|   |

## Examples
```pascal
Opacity(1);
```
```python
import vs

# Sets the active opacity.
opacity = 1

vs.Opacity(opacity)
```

## Version
Availability: from VectorWorks13.0

## Category
* Document Attributes